src/openpersonen/templates/request/RequestNationaliteitHistorie.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:gml="http://www.opengis.net/gml">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:npsLv01>
         <ns:stuurgegevens>
            <StUF:berichtcode>?</StUF:berichtcode>
            <!--Optional:-->
            <StUF:zender>
                <!--Optional:-->
                <StUF:organisatie>{{ zender_organisatie }}</StUF:organisatie>
                <StUF:applicatie>{{ zender_applicatie }}</StUF:applicatie>
                <!--Optional:-->
                {% if zender_administratie %}
                    <StUF:administratie>{{ zender_administratie }}</StUF:administratie>
                {% endif %}
                <!--Optional:-->
                {% if zender_gebruiker %}
                    <StUF:gebruiker>{{ zender_gebruiker }}</StUF:gebruiker>
                {% endif %}
            </StUF:zender>
            <!--Optional:-->
            <StUF:ontvanger>
                <!--Optional:-->
                <StUF:organisatie>{{ ontvanger_organisatie }}</StUF:organisatie>
                <StUF:applicatie>{{ ontvanger_applicatie }}</StUF:applicatie>
                <!--Optional:-->
                {% if ontvanger_administratie %}
                    <StUF:administratie>{{ ontvanger_administratie }}</StUF:administratie>
                {% endif %}
                <!--Optional:-->
                {% if ontvanger_gebruiker %}
                    <StUF:gebruiker>{{ ontvanger_gebruiker }}</StUF:gebruiker>
                {% endif %}
            </StUF:ontvanger>
            <!--Optional:-->
            <StUF:referentienummer>{{ referentienummer }}</StUF:referentienummer>
            <!--Optional:-->
            <StUF:tijdstipBericht>{{ tijdstip_bericht }}</StUF:tijdstipBericht>
            <StUF:entiteittype>?</StUF:entiteittype>
         </ns:stuurgegevens>
         <ns:parameters>
            <StUF:sortering>?</StUF:sortering>
            <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
            <!--Optional:-->
            <StUF:maximumAantal>15</StUF:maximumAantal>
            <!--Optional:-->
            <StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
            <!--Optional:-->
            <StUF:indicatorAantal>false</StUF:indicatorAantal>
         </ns:parameters>
         <!--Optional:-->
         <ns:gelijk StUF:entiteittype="NPS">
            <ns:inp.bsn StUF:exact="true">{{ bsn|escape }}</ns:inp.bsn>
         </ns:gelijk>
         <ns:scope>
            <ns:object StUF:entiteittype="NPS">
                <ns:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT">
                   <!--Zero or more repetitions:-->
                   <ns:historieMaterieel>
                      <!--Optional:-->
                      <ns:aanduidingStrijdigheidNietigheid/>
                      <StUF:tijdvakGeldigheid>
                         <StUF:beginGeldigheid StUF:exact="true" StUF:indOnvolledigeDatum="V" />
                         <StUF:eindGeldigheid StUF:exact="true" StUF:indOnvolledigeDatum="V" />
                      </StUF:tijdvakGeldigheid>
                   </ns:historieMaterieel>
                   <ns:historieFormeelRelatie>
                      <ns:gerelateerde StUF:entiteittype="NAT">
                         <ns:code StUF:exact="true"/>
                      </ns:gerelateerde>
                      <!--Optional:-->
                      <ns:inp.redenVerkrijging StUF:exact="true" />
                      <ns:inp.redenVerlies StUF:exact="true" />
                   </ns:historieFormeelRelatie>
                </ns:inp.heeftAlsNationaliteit>
            </ns:object>
         </ns:scope>
      </ns:npsLv01>
   </soapenv:Body>
</soapenv:Envelope>
